hierarchy -auto-top
proc
# splice
opt
clean
flatten

# bmuxmap
# pmuxtree

# opt_expr
# opt_clean

# 确保无时序单元
select -assert-none t:$dff t:$adff t:$dffe t:$dlatch

stat
